## Data Loading and Normalization of flat csv into Mysql Server

In [ ]:
import mysql.connector
import pandas as pd

In [2]:
import mysql.connector

# Connect to MySQL server
cnx = mysql.connector.connect(user='root', password='',
                              host='localhost', port=3306)

# Create a new database
cursor = cnx.cursor()
cursor.execute("CREATE DATABASE hotels")

# Close the cursor and connection
cursor.close()
cnx.close()

In [4]:
import mysql.connector

# Connect to MySQL server and database
cnx = mysql.connector.connect(user='root', password='Mohit9944.',
                              host='localhost', port=3306,
                              database='hotels')
cursor = cnx.cursor()

In [5]:
hoteldf=pd.read_csv("hotelsreservation.csv")

In [37]:
hoteldf.columns

Index(['Booking_ID', 'no_of_adults', 'no_of_children', 'no_of_weekend_nights',
       'no_of_week_nights', 'type_of_meal_plan', 'required_car_parking_space',
       'room_type_reserved', 'lead_time', 'arrival_year', 'arrival_month',
       'arrival_date', 'market_segment_type', 'repeated_guest',
       'no_of_previous_cancellations', 'no_of_previous_bookings_not_canceled',
       'avg_price_per_room', 'no_of_special_requests', 'booking_status',
       'name', 'Customerid', 'room number', 'employee id', 'employee name',
       'role', 'checkout_date', 'payment_date', 'paymenttype',
       'paymentamount'],
      dtype='object')

In [42]:
hoteldf = hoteldf.rename(columns={'employee id': 'employeeid'})

In [45]:
hoteldf = hoteldf.rename(columns={'room number': 'roomnumber'})

In [6]:
cursor.execute('''
    CREATE TABLE customers (
        customer_id int primary key,
        name varchar(255),
        repeated_guest int,
        no_of_previous_cancellations int,
        no_of_previous_bookings_not_canceled int,
        
    )
''')

In [7]:
for row in hoteldf.itertuples():
    cursor.execute('''
        INSERT INTO customers (customer_id, name, 
                                    repeated_guest,no_of_previous_cancellations ,no_of_previous_bookings_not_canceled )
        VALUES (%s, %s, %s, %s, %s)
        ''',
        (row.Customerid,
        row.name,
        row.repeated_guest,
        row.no_of_previous_cancellations,
        row.no_of_previous_bookings_not_canceled))
    cnx.commit()

In [53]:
cursor.execute('''
    CREATE TABLE bookingdetails (
        booking_id varchar(20) primary key,
        customer_id int references customers(customer_id),
        roomnumber int references rooms(roomnumber),
        employee_id varchar(20) references employees(employee_id),
        no_of_adults int,
        no_of_children int,
        no_of_weekend_nights int,
        no_of_week_nights int
    )
''')

In [54]:
for row in hoteldf.itertuples():
    cursor.execute('''
        INSERT INTO bookingdetails (booking_id ,
        customer_id ,
        roomnumber,
        employee_id,
        no_of_adults ,
        no_of_children ,
        no_of_weekend_nights ,
        no_of_week_nights  )
        VALUES (%s, %s, %s, %s, %s,%s,%s,%s)
        ''',
        (row.Booking_ID,
        row.Customerid ,
        row.roomnumber,
        row.employeeid,
        row.no_of_adults ,
        row.no_of_children,
        row.no_of_weekend_nights,
        row.no_of_week_nights
         
        ))
    cnx.commit()

In [12]:
cursor.execute('''
    CREATE TABLE dates (
    booking_id varchar(20) references bookingdetails(booking_id),
    lead_time int,
    arrival_date datetime,
    checkoutdate datetime )
''')

In [15]:
for row in hoteldf.itertuples():
    cursor.execute('''
        INSERT INTO dates (booking_id ,
        lead_time ,
        arrival_date ,
    checkoutdate   )
        VALUES (%s, %s, %s, %s)
        ''',
                   
        ( row.Booking_ID,
            row.lead_time,
        row.arrival_date,
        row.checkout_date
         
        ))
    cnx.commit()

In [ ]:
cursor.execute('''
    CREATE TABLE members (
        booking_id varchar(20) references bookingdetains(booking_id),
        customer_id int references customers(customer_id),
        no_of_adults int,
        no_of_children int,
        no_of_weekend_nights int,
        no_of_week_nights int,
        lead_time int,
        arrival_year int,
        arrival_month int,
        arrival_date int,
        specialrequests int,
        requiredcarspace int
    )
''')

In [16]:
cursor.execute('''
    CREATE TABLE specialrequest (
        customer_id int references customers(customer_id),
        specialrequests int,
        requiredcarspace int
    )
''')

In [17]:
for row in hoteldf.itertuples():
    cursor.execute('''
        INSERT INTO specialrequest (customer_id, specialrequests,requiredcarspace)
        VALUES (%s, %s,%s)
        ''',
        (row.Customerid,
        row.no_of_special_requests,
        row.required_car_parking_space))
    cnx.commit()

In [18]:
cursor.execute('''
    CREATE TABLE BookingStatus (
        booking_id varchar(20) references bookingdetails(booking_id),
        booking_status varchar(20) 
    )
''')

In [19]:
for row in hoteldf.itertuples():
    cursor.execute('''
        INSERT INTO BookingStatus (booking_id,booking_status)
        VALUES (%s, %s)
        ''',
        (row.Booking_ID,
        row.booking_status))
    cnx.commit()

In [20]:
cursor.execute('''
    CREATE TABLE mealplan (
        booking_id varchar(20) references bookingdetails(booking_id),
        mealtype varchar (20)
    )
''')

In [21]:
for row in hoteldf.itertuples():
    cursor.execute('''
        INSERT INTO mealplan (booking_id,mealtype)
        VALUES (%s, %s)
        ''',
        (row.Booking_ID,
        row.type_of_meal_plan ))
    cnx.commit()

In [22]:
cursor.execute('''
    CREATE TABLE Price (
        booking_id varchar(20) references bookingdetails(booking_id),
        price float(8)
    )
''')

In [23]:
for row in hoteldf.itertuples():
    cursor.execute('''
        INSERT INTO price (booking_id,price )
        VALUES (%s, %s)
        ''',
        (row.Booking_ID,
         row.avg_price_per_room ))
    cnx.commit()

In [24]:
cursor.execute('''
    CREATE TABLE Payment (
        booking_id varchar(20) references bookingdetails(booking_id),
        paymenttype varchar(20),
        paymentamount float(10),
        paymentdate datetime

    )
''')

In [26]:
hoteldf.columns

Index(['Booking_ID', 'no_of_adults', 'no_of_children', 'no_of_weekend_nights',
       'no_of_week_nights', 'type_of_meal_plan', 'required_car_parking_space',
       'room_type_reserved', 'lead_time', 'arrival_year', 'arrival_month',
       'arrival_date', 'market_segment_type', 'repeated_guest',
       'no_of_previous_cancellations', 'no_of_previous_bookings_not_canceled',
       'avg_price_per_room', 'no_of_special_requests', 'booking_status',
       'name', 'Customerid', 'room number', 'employee id', 'employee name',
       'role', 'checkout_date', 'payment_date', 'payment type',
       'paymentamount'],
      dtype='object')

In [27]:
hoteldf = hoteldf.rename(columns={'payment type': 'paymenttype', 'employeename': 'employeename'})

In [29]:
for row in hoteldf.itertuples():
    cursor.execute('''
        INSERT INTO payment (booking_id,paymenttype,paymentamount,paymentdate )
        VALUES (%s, %s,%s, %s)
        ''',
        (row.Booking_ID,
         row.paymenttype,
        row.paymentamount,
        row.payment_date))
    cnx.commit()

In [30]:
employee=pd.read_csv("employees.csv")

In [31]:
employee.head()

  employee id employee name        role
0       E1001           Sam   Assistant
1       E1002          Sara   Assistant
2       E1003        Joshua  Supervisor
3       E1004         Sarah  Supervisor
4       E1005          Kent     Manager

In [32]:
cursor.execute('''
    CREATE TABLE Employees(
        employee_id varchar(20) primary key,
        name varchar(20),
        role varchar(20)
    )
''')

In [33]:
employee = employee.rename(columns={'employee id': 'id', 'employee name': 'name'})

In [34]:
for row in employee.itertuples():
    cursor.execute('''
        INSERT INTO Employees (employee_id,name,role )
        VALUES (%s, %s,%s)
        ''',
        (row.id,
         row.name,
        row.role))
    cnx.commit()

In [37]:
cursor.execute('''
    CREATE TABLE ParkingSpace(
    booking_id varchar(20) references bookingdetails(booking_id),
         customername varchar(255),
        carparking int
    )
''')

In [38]:
for row in hoteldf.itertuples():
    cursor.execute('''
        INSERT INTO ParkingSpace (booking_id,customername,carparking )
        VALUES (%s, %s,%s)
        ''',
        (row.Booking_ID,
         row.name,
        row.required_car_parking_space))
    cnx.commit()

In [48]:
room=pd.read_csv("rooms.csv")

In [49]:
room.head()

   room number room_type_reserved
0          142        Room_Type 1
1          146        Room_Type 1
2          153        Room_Type 1
3          131        Room_Type 1
4          116        Room_Type 1

In [51]:
room = room.rename(columns={'room number': 'roomnumber'})

In [52]:
for row in room.itertuples():
    cursor.execute('''
        INSERT INTO rooms(roomnumber,room_type_reserved )
        VALUES (%s, %s)
        ''',
        (row.roomnumber,
         row.room_type_reserved))
    cnx.commit()